app/views/comments/_comment.haml

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
- @post.comments.each do |comment|
  %img.img-circle{:alt => "...", :src => "../assets/user8-100x100.jpg", :style => "width:64px; height:64px"}
  - epa = User.find_by_id(comment.user_id)