app/views/posts/index.html.haml

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
                    %img.media-object{:alt => "...", :src => "assets/user3-100x100.jpg", :style => "width:64px; height:64px"}
                    - @user2 = User.find(post.user_id)