app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("content", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "ds\r\n"], ["post_id", 1], ["user_id", 1], ["created_at", "2016-06-28 12:42:17.306560"], ["updated_at", "2016-06-28 12:42:17.306560"]]