app/controllers/posts_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @user = current_user
    #Obtienes todos los posts en orden descendiente del usario logeado
    @posts = @user.get_posts
    #Obienes la lista de usarios que no sigue
    @users = User.all

INSERT INTO "posts" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "dasg"], ["user_id", 2], ["created_at", "2016-06-28 16:07:27.031151"], ["updated_at", "2016-06-28 16:07:27.031151"]]
---
  def create
    @user = current_user
    #Creacion de nuevos posts con el modal
    @post = Post.new(post_params)
    @user.posts.push @post